Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_and_disability/grant_aid_scheme_for_employers_with_disabled_staff.html.txt.tmx
Source language: en
Languages: ga

source: The Wage Subsidy Scheme offers financial support for employers who employ certain people with disabilities on a full-time basis (between 21 hours and 39 hours per week)
ga: Is scéim é an Scéim Fhóirdheontas Tuarastail a sholáthraíonn tacaíocht airgid do fhostóirí a fhostaíonn daoine faoi mhíchumas ar bhunús lánaimseartha (21 uaire nó níos mó)

source: The scheme is one of the workplace supports for employers provided by the Department of Social Protection to encourage the employment of people with disabilities
ga: Is an scéim ceann de na tacaíochtaí san ionad oibre d’fhostóirí atá soláthartha ag an Roinn Coimirce Sóisialaí chun fostaíocht daoine faoi mhíchumas a spreagadh

source: Sometimes the nature of a disability can restrict an employee's productivity in comparison with other staff, irrespective of their ability to do a job
ga: Uaireanta is féidir le míchumas cur isteach ar tháirgiúlacht an fhostaithe i gcomparáid le baill fhoirne eile, gan tagairt dá c(h)umas an obair a dhéanamh

source: In situations where this restriction results in a loss of productivity for the employer, the Wage Subsidy Scheme (WSS) allows the employer make up the shortfall through grant assistance
ga: I gcásanna ina mbíonn laghdú ar tháirgiúlacht don fhostóir mar thoradh ar an mbac seo, cuireann an Scéim Fhóirdheontas Tuarastail (SFT) ar chumas an fhostóra an caillteanas seo a fháil ar ais trí chúnamh deontais

source: It is illegal to discriminate against any employee on the basis of disability and this right is set down in employment equality legislation
ga: Tá sé neamhdhleathach leatrom a dhéanamh ar aon fhostaí ar bhunús míchumais agus tá an ceart seo leagtha síos i reachtaíocht um chomhionannas fostaíochta

source: However, it is permitted to discriminate on the grounds of disability where it can be shown that "there is clear actuarial or other evidence that significantly increased costs would result, if the discrimination were not permitted." For this reason, employers that employ staff with disabilities with proven productivity rates of 50-80% will not lose out if they employ staff with disabilities as the grant aid under this scheme will make up any shortfall in reduced productivity
ga: Tá sé ceadaithe leatrom a fheidhmiú ar fhoras an mhíchumais, áfach, nuair is féidir a thaispeáint "go bhfuil fianaise achtúire nó de chineál eile ann a léiríonn go soiléir go mbeadh méadú suntasach ar chostais mura gceadófaí an t-idirdhealú sin." Ar an ábhar sin, má tá foireann a bhfuil ráta táirgiúlachta idir 50 - 80% cruthaithe acu ag fostóirí, ní chaillfidh siad aon rud má fhostaíonn siad daoine le míchumas toisc go bhfaighidh siad deontas mar chúiteamh ar aon chaillteanas táirgiúlachta

source: An employer must also complete a productivity assessment form to certify the employee’s productivity deficit
ga: Tá na coinníollacha céanna fostaíochta i bhfeidhm d'fhostaithe faoin scéim seo agus atá i bhfeidhm don fhoireann eile uile

source: The Department reserves the right to conduct additional monitoring visits without notice to the employer’s premises, when and where required
ga: Tá na fostaithe seo i dteideal ranníocaíochtaí ÁSPC, saoire bhliantúil asbhaintí cánacha, conarthaí fostaíochta agus an t-íosphá

source: The WSS is divided into 3 strands
ga: Tá an SFT roinnte ina trí dhual

source: Strand 1 is a wage subsidy payment paid to the employer to make up the shortfall if a disabled employee has a productivity level of between 80% or less (compared to other staff)
ga: Is é Dual 1 an íocaíocht fhóirdheontas pá. Má tá leibhéal táirgiúlachta 80% nó níos lú ag fostaí faoi mhíchumas (i gcomparáid le baill fhoirne eile) íoctar fóirdheontas leis an bhfostóir chun an t-easnamh a dhéanamh suas

source: The employee must work at least 21 hours a week up to a maximum of 39 hours a week
ga: Ní mór don fhostaí 21 uair sa tseachtain suas go 39 uair sa tseachtain a hoibriú

source: The rate of subsidy is €5.30 a hour based on the hours worked
ga: Tá an ráta fhóirdheontas bunaithe ar na huaireanta oibrithe

source: The maximum annual subsidy is €10,748 based on a 39-hour week
ga: Is é an fóirdheontas bliantúil uasta ná €10,748, bunaithe ar sheachtain de 39 uaireanta

source: Strand 2 is a payment to companies that employ more than 2 disabled employees
ga: Is íocaíocht í Dual 2 do chuideachtaí a fhostaíonn níos mó ná beirt fhostaí faoi mhíchumas

source: The "top-up" grant covers supervisory, management and other work-based costs
ga: Clúdaíonn an deontas ‘breise’ costais mhaoirseachta, bhainistíochta agus costais eile a bhaineann leis an obair

source: The top-up grant is based on the overall number of disabled employees from an additional 10% of the wage subsidy for 3 to 6 disabled employees to a maximum of 50% of the wage subsidy for 23+ disabled employees
ga: Tá an deontas breise bunaithe ar líon iomlán na bhfostaithe faoi mhíchumas ó 10% breise den fhóirdheontas pá i gcomhair idir 3 agus 6 fostaithe faoi mhíchumas suas go huasmhéid 50% den fhóirdheontas pá i gcomhair ó 23+ fostaí faoi mhíchumas

source: Strand 3 is a grant to companies that employ 30 or more disabled employees to enable them to employ an Employment Assistance Officer (EAO)
ga: Is éard is Dual 3 ann ná deontas do chuideachtaí a fhostaíonn 30 nó níos mó fostaí faoi mhíchumas chun cur ar a gcumas Oifigeach Cúnta Fostaíochta (OCF) a fhostú

source: The EAO is employed to support and assist disabled employees with their employment needs
ga: Tá an OCF fostaithe chun tacaíocht agus cúnamh d'fhostaí faoi mhíchumas lena gcuid riachtanais a thabhairt

source: The grant is €30,000 per annum. Conditions of employment
ga: Is €30,000 in aghaidh na bliana atá sa deontas

source: Employees for whom the employer claims grant assistance under this scheme is subject to the same conditions of employment as all other staff
ga: Nuair a thosaíonn fostaí fostaíocht faoin Scéim Fóirdheontas Tuarastail ní mór dó/di éirí as a phríomhíocaíocht leasa shóisialaigh

source: The Department of Social Protection, the employer and the employee agree the wage subsidy to be paid after the first month of employment
ga: Aontaíonn an Roinn Coimirce Sóisialaí an fostóir agus an fostaí an fóirdheontas tuarastail iníoctha tar éis an chéad mhí fostaíochta

source: Grant assistance is payable to the employer by electronic fund transfer on a frequency as agreed with the Department (normally on a monthly basis)
ga: Íoctar an deontas leis an fhostóir le haistriú leictreonach airgid ar bhonn rialta atá aontaithe leis an Roinn (go hiondúil is go míosúil a íoctar an deontas)

source: The employer pays the going rate for the job
ga: Íocfaidh an fostóír an ráta oibre atá ar siúl

source: Generally, the employee must give up their primary social welfare payment when they start employment under the Wage Subsidy Scheme (WSS). For example, if you are on Jobseeker’s Allowance, you must stop claiming this payment
ga: De ghnáth, nuair a thosaíonn fostaí fostaíocht faoin Scéim Fóirdheontas Tuarastail (SFT) ní mór dó éirí as a phríomhíocaíocht leasa shóisialaigh

source: However, new applicants for the scheme who are currently getting Disability Allowance (DA) or Blind Pension (BP) may apply for the DA/BP rehabilitative work disregard together with the WSS, provided they are working at least 21 hours a week
ga: Áfach, is féidir le hiarratasóirí nua a fhaigheann Liúntas Míchumais láithreach, iarratas a dhéanamh ar an neamhaird tuillimh athshlánúcháin in éineacht le SFT, ar an gcoinníoll go n-oibríonn siad 21 uair sa tseachtain ar a laghad

source: All employers applying for this scheme must be in possession of a current tax clearance certificate
ga: Conas iarratas a dhéanamh

source: If you are someone with a disability who is interested in entering or returning to employment, you should get in touch with your local employment services office, to find out about supports available in your area
ga: Chun iarratas ar mhaoine faoin Scéim d'Fhóirdheontas Tuarastail caithfidh an fostóir agus an fostaí dul i dteagmháil le d'oifig seirbhísí fostaíochta áitiúil

source: If you are unemployed, have a disability and are not receiving a disability payment, you will need to provide a recent specialist’s report or doctor’s letter, confirming your disability
ga: Caithfidh siad cruinniú le hoifigeach seirbhísí fostaíochta a shocrú agus na foirmeacha iarratais den scéim a chomhlánú

source: Your doctor must also complete a confidential Medical Report form confirming that you have a disability which could cause a shortfall in productivity
ga: Ní mór deimhniú imréitigh cánach reatha a bheith ag gach fostóir atá ag déanamh iarratas ar an scéim

source: You will also need this medical evidence if you have been awarded a Disablement Pension or Gratuity assessed at less than 20% for life, or have been awarded Disablement Benefit on the basis of a provisional assessment
ga: Ba chóir d'fhostóirí dul i dteagmháil leis an oifig seirbhísí fostaíochta áitiúil má tá siad ag smaoineamh ar dhuine le míchumas a fhostú, nó má tá breis eolais uathu faoi thacaíocht eile atá le fáil ag fostóirí a bhfuil daoine le míchumas fostaithe acu, chun breis eolais a fháil

source: You can find more information in the Department of Social Protection’s Operational Guidelines for the Wage Subsidy Scheme (pdf)
ga: Más duine faoi mhíchumas tú atá suim agat dul nó filleadh ar fhostaíocht, ba chóir duit dul i dteagmháil le d'oifig seirbhísí fostaíochta áitiúil agus faigh amach tacaíochtaí ar fáil i do cheantar

source: Further information about employment and disability is available here and from your local Intreo Centre. You can also download the relevant forms from welfare.ie
ga: Tá tuilleadh faisnéise faoi fhostaíocht agus míchumas anseo agus ó d'oifig seirbhísí fostaíochta áitiúil nó ionad Intreo
